src/cf/AccumulationRegisters/уатЗаказыГрузоотправителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыГрузоотправителей</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество, всегда 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Comment>Только родительский грузы (не этапы)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыКонтейнеров_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатЭтапыМультимодальныхПеревозок_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатЭтапыМультимодальныхПеревозок_уэ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>xПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>xПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСПеревозчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФормированияКомплектовДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНастройкиКомплектовДокументов_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьИзвлечениеГрузовИзКонтейнера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьРазмещениеГрузовВКонтейнере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаОтправление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаНазначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСтатусыГрузов_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСтатусыГрузов_уэ</Name>
			<Comment>Статусы грузов (уэ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатТекущееСостояниеВыполненияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатТекущееСостояниеВыполненияЗаказов</Name>
			<Comment>Текущее состояние выполнения заказов (уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияВыполненияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыполнено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатСостоянияВыполненияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСостоянияВыполненияЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВыполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатДетализацияЗаказаГрузоотправителя_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатДетализацияЗаказаГрузоотправителя_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрузовымМестам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыТочекМаршрута</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяПогрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяРазгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатОтклонениеГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОтклонениеГруза</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаказыГрузоотправителей</xr:Item>
				<xr:Item>AccumulationRegister.уатГрузыКПеревозке_уэ</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьУатГрузыВПути_уэ</xr:Item>
				<xr:Item>InformationRegister.уатСтатусыГрузов_уэ</xr:Item>
				<xr:Item>InformationRegister.уатПричиныОтклоненияЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>Заказчик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказГрузоотправителя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПричиныЗакрытияЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатЗаказыГрузоотправителей/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	Исключение
		Регистратор = Неопределено;
	КонецПопытки;
	
	ОтклонениеГруза = Ложь;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.уатОтклонениеГруза") Тогда
		ОтклонениеГруза = Истина; 
		ВсеОтклоненныеЗаказы = Новый Массив();
		Для Каждого ТекСтрока Из Регистратор.Заказы Цикл
			Если НЕ ТекСтрока.ПричинаОтклонения.ЗакрытУспешно Тогда
				 ВсеОтклоненныеЗаказы.Добавить(ТекСтрока.ЗаказГрузоотправителя);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		ТаблицаСтатусовГрузов = СформироватьСтатусыГрузов(Регистратор); 
		ДополнительныеСвойства.Вставить("ТаблицаСтатусовГрузов", ТаблицаСтатусовГрузов);
	КонецЕсли;
	
	СтарыйНабор = РегистрыНакопления.уатЗаказыГрузоотправителей.СоздатьНаборЗаписей();
	Для каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Использование Тогда
			СтарыйНабор.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	СтарыйНабор.Прочитать();
	
	Заказы				 = Новый Массив();
	ОтклоненныеЗаказы	 = Новый Массив();
	мсвЭтапов			 = Новый Массив();
	Для Каждого СтрокаНабора Из СтарыйНабор Цикл  
		Если Заказы.Найти(СтрокаНабора.ЗаказГрузоотправителя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Заказы.Добавить(СтрокаНабора.ЗаказГрузоотправителя); 
		Если СтрокаНабора.ЗаказГрузоотправителя.ЭтоЭтап Тогда 
			мсвЭтапов.Добавить(СтрокаНабора.ЗаказГрузоотправителя);
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл  
		Если Заказы.Найти(СтрокаНабора.ЗаказГрузоотправителя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Заказы.Добавить(СтрокаНабора.ЗаказГрузоотправителя);
		Если СтрокаНабора.ЗаказГрузоотправителя.ЭтоЭтап Тогда 
			мсвЭтапов.Добавить(СтрокаНабора.ЗаказГрузоотправителя);
		КонецЕсли;
	КонецЦикла;
	
	Если ОтклонениеГруза Тогда
		Для Каждого ТекЗаказ Из Заказы Цикл
			Если ВсеОтклоненныеЗаказы.Найти(ТекЗаказ) <> Неопределено Тогда
				ОтклоненныеЗаказы.Добавить(ТекЗаказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если мсвЭтапов.Количество() > 0 Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("мсвЭтапов", мсвЭтапов);  
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя
		|ИЗ
		|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
		|ГДЕ
		|	уатЭтапыМультимодальныхПеревозок_уэ.Этап В(&мсвЭтапов)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Заказы.Найти(Выборка.ЗаказГрузоотправителя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Заказы.Добавить(Выборка.ЗаказГрузоотправителя);
		КонецЦикла;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗаказыВНаборе", 		 Заказы);
	ДополнительныеСвойства.Вставить("ОтклоненныеЗаказы",	 ОтклоненныеЗаказы);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;

	ОтклоненныеЗаказы = ДополнительныеСвойства.ОтклоненныеЗаказы;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЗаказыВНаборе",		 ДополнительныеСвойства.ЗаказыВНаборе);
	Запрос.УстановитьПараметр("ОтклоненныеЗаказы",	 ОтклоненныеЗаказы);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказГрузоотправителя.Ссылка КАК Ссылка,
	|	уатЗаказГрузоотправителя.Мультимодальный КАК Мультимодальный,
	|	уатЗаказГрузоотправителя.ЭтоЭтап КАК ЭтоЭтап,
	|	уатЗаказГрузоотправителя.Проведен КАК Проведен
	|ПОМЕСТИТЬ втЗаказы
	|ИЗ
	|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
	|ГДЕ
	|	уатЗаказГрузоотправителя.Ссылка В(&ЗаказыВНаборе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатЭтапыМультимодальныхПеревозок_уэ.Этап КАК Этап
	|ПОМЕСТИТЬ втЭтапы
	|ИЗ
	|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
	|ГДЕ
	|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя В(&ЗаказыВНаборе)
	|	И НЕ уатЭтапыМультимодальныхПеревозок_уэ.Этап В (&ОтклоненныеЗаказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказыГрузоотправителейОстаткиИОбороты.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	СУММА(уатЗаказыГрузоотправителейОстаткиИОбороты.КоличествоРасход) КАК Количество
	|ПОМЕСТИТЬ втКолВоРасход
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			ЗаказГрузоотправителя В
	|				(ВЫБРАТЬ
	|					втЭтапы.Этап КАК ЗаказГрузоотправителя
	|				ИЗ
	|					втЭтапы КАК втЭтапы)) КАК уатЗаказыГрузоотправителейОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	уатЗаказыГрузоотправителейОстаткиИОбороты.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатЗаказыГрузоотправителейОстатки.КоличествоОстаток КАК ЕстьОстаток,
	|	NULL КАК ЕстьРасход
	|ПОМЕСТИТЬ втТабСтатусов
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(
	|			,
	|			ЗаказГрузоотправителя В
	|				(ВЫБРАТЬ
	|					втЭтапы.Этап КАК ЗаказГрузоотправителя
	|				ИЗ
	|					втЭтапы КАК втЭтапы)) КАК уатЗаказыГрузоотправителейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втКолВоРасход.ЗаказГрузоотправителя,
	|	NULL,
	|	втКолВоРасход.Количество
	|ИЗ
	|	втКолВоРасход КАК втКолВоРасход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТабСтатусов.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	МАКСИМУМ(втТабСтатусов.ЕстьОстаток) КАК ЕстьОстаток,
	|	МАКСИМУМ(втТабСтатусов.ЕстьРасход) КАК ЕстьРасход
	|ПОМЕСТИТЬ втСостояния
	|ИЗ
	|	втТабСтатусов КАК втТабСтатусов
	|
	|СГРУППИРОВАТЬ ПО
	|	втТабСтатусов.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втЭтапы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	втЭтапы.Этап КАК Этап,
	|	ВЫБОР
	|		КОГДА втЭтапы.Этап.Проведен
	|				И ЕСТЬNULL(втСостояния.ЕстьРасход, 0) > 0
	|				И ЕСТЬNULL(втСостояния.ЕстьОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен)
	|		КОГДА втЭтапы.Этап.Проведен
	|					И ЕСТЬNULL(втСостояния.ЕстьРасход, 0) > 0
	|					И втСостояния.ЕстьОстаток ЕСТЬ NULL
	|				ИЛИ втСостояния.ЕстьОстаток = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Выполнен)
	|		КОГДА втЭтапы.Этап.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Открыт)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый)
	|	КОНЕЦ КАК СостояниеВыполнения,
	|	втСостояния.ЕстьОстаток КАК ЕстьОстаток,
	|	втСостояния.ЕстьРасход КАК ЕстьРасход
	|ПОМЕСТИТЬ втСтатусыРодительскихЗаказов
	|ИЗ
	|	втЭтапы КАК втЭтапы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСостояния КАК втСостояния
	|		ПО втЭтапы.Этап = втСостояния.ЗаказГрузоотправителя
	|
	|СГРУППИРОВАТЬ ПО
	|	втЭтапы.ЗаказГрузоотправителя,
	|	втЭтапы.Этап,
	|	ВЫБОР
	|		КОГДА втЭтапы.Этап.Проведен
	|				И ЕСТЬNULL(втСостояния.ЕстьРасход, 0) > 0
	|				И ЕСТЬNULL(втСостояния.ЕстьОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен)
	|		КОГДА втЭтапы.Этап.Проведен
	|					И ЕСТЬNULL(втСостояния.ЕстьРасход, 0) > 0
	|					И втСостояния.ЕстьОстаток ЕСТЬ NULL
	|				ИЛИ втСостояния.ЕстьОстаток = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Выполнен)
	|		КОГДА втЭтапы.Этап.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Открыт)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый)
	|	КОНЕЦ,
	|	втСостояния.ЕстьОстаток,
	|	втСостояния.ЕстьРасход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(втСтатусыРодительскихЗаказов.СостояниеВыполнения, ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый))) > 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен)
	|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(втСтатусыРодительскихЗаказов.СостояниеВыполнения, ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый)))
	|	КОНЕЦ КАК СостояниеВыполнения,
	|	СУММА(втСтатусыРодительскихЗаказов.ЕстьОстаток) КАК ЕстьОстаток,
	|	СУММА(втСтатусыРодительскихЗаказов.ЕстьРасход) КАК ЕстьРасход
	|ПОМЕСТИТЬ ТабСтатусовРодительскихЗаказов
	|ИЗ
	|	втСтатусыРодительскихЗаказов КАК втСтатусыРодительскихЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказыГрузоотправителейОстаткиИОбороты.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	СУММА(уатЗаказыГрузоотправителейОстаткиИОбороты.КоличествоРасход) КАК Количество
	|ПОМЕСТИТЬ втКолВоРасходОсновныеЗаказы
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.ОстаткиИОбороты(, , , , ЗаказГрузоотправителя В (&ЗаказыВНаборе)) КАК уатЗаказыГрузоотправителейОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	уатЗаказыГрузоотправителейОстаткиИОбороты.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатЗаказыГрузоотправителейОстатки.КоличествоОстаток КАК ЕстьОстаток,
	|	NULL КАК ЕстьРасход
	|ПОМЕСТИТЬ втТабСтатусовОсновныеЗаказы
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(, ЗаказГрузоотправителя В (&ЗаказыВНаборе)) КАК уатЗаказыГрузоотправителейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втКолВоРасходОсновныеЗаказы.ЗаказГрузоотправителя,
	|	NULL,
	|	втКолВоРасходОсновныеЗаказы.Количество
	|ИЗ
	|	втКолВоРасходОсновныеЗаказы КАК втКолВоРасходОсновныеЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТабСтатусовОсновныеЗаказы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	МАКСИМУМ(втТабСтатусовОсновныеЗаказы.ЕстьОстаток) КАК ЕстьОстаток,
	|	МАКСИМУМ(втТабСтатусовОсновныеЗаказы.ЕстьРасход) КАК ЕстьРасход
	|ПОМЕСТИТЬ Состояния
	|ИЗ
	|	втТабСтатусовОсновныеЗаказы КАК втТабСтатусовОсновныеЗаказы
	|
	|СГРУППИРОВАТЬ ПО
	|	втТабСтатусовОсновныеЗаказы.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказы.Ссылка КАК Заказ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втЗаказы.Мультимодальный
	|					И НЕ втЗаказы.ЭтоЭтап
	|				ТОГДА ЕСТЬNULL(ТабСтатусовРодительскихЗаказов.СостояниеВыполнения, ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый))
	|			ИНАЧЕ ВЫБОР
	|					КОГДА втЗаказы.Проведен
	|							И ЕСТЬNULL(Состояния.ЕстьРасход, 0) > 0
	|							И ЕСТЬNULL(Состояния.ЕстьОстаток, 0) > 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен)
	|					КОГДА втЗаказы.Проведен
	|								И ЕСТЬNULL(Состояния.ЕстьРасход, 0) > 0
	|								И Состояния.ЕстьОстаток ЕСТЬ NULL
	|							ИЛИ Состояния.ЕстьОстаток = 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Выполнен)
	|					КОГДА втЗаказы.Проведен
	|							И НЕ Состояния.ЕстьОстаток ЕСТЬ NULL
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Открыт)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Новый)
	|				КОНЕЦ
	|		КОНЕЦ) КАК Состояние,
	|	СУММА(ВЫБОР
	|			КОГДА втЗаказы.Мультимодальный
	|					И НЕ втЗаказы.ЭтоЭтап
	|				ТОГДА ЕСТЬNULL(ТабСтатусовРодительскихЗаказов.ЕстьРасход, 0)
	|			ИНАЧЕ ЕСТЬNULL(Состояния.ЕстьРасход, 0)
	|		КОНЕЦ) КАК КоличествоВыполнено,
	|	СУММА(ВЫБОР
	|			КОГДА втЗаказы.Мультимодальный
	|					И НЕ втЗаказы.ЭтоЭтап
	|				ТОГДА ЕСТЬNULL(ТабСтатусовРодительскихЗаказов.ЕстьОстаток, 0) + ЕСТЬNULL(ТабСтатусовРодительскихЗаказов.ЕстьРасход, 0)
	|			ИНАЧЕ ЕСТЬNULL(Состояния.ЕстьОстаток, 0) + ЕСТЬNULL(Состояния.ЕстьРасход, 0)
	|		КОНЕЦ) КАК КоличествоВсего
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	втЗаказы КАК втЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСтатусовРодительскихЗаказов КАК ТабСтатусовРодительскихЗаказов
	|		ПО втЗаказы.Ссылка = ТабСтатусовРодительскихЗаказов.ЗаказГрузоотправителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Состояния КАК Состояния
	|		ПО втЗаказы.Ссылка = Состояния.ЗаказГрузоотправителя
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя
	|ПОМЕСТИТЬ втЗакрытие
	|ИЗ
	|	Документ.уатОтклонениеГруза.Заказы КАК уатОтклонениеГрузаЗаказы
	|ГДЕ
	|	уатОтклонениеГрузаЗаказы.Ссылка.Проведен
	|	И НЕ уатОтклонениеГрузаЗаказы.ПричинаОтклонения.ЗакрытУспешно
	|	И НЕ уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя В (&ОтклоненныеЗаказы)
	|	И уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя В(&ЗаказыВНаборе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатСтатусыГрузов_уэСрезПоследних.Заказ КАК Заказ,
	|	МАКСИМУМ(уатСтатусыГрузов_уэСрезПоследних.Статус) КАК Статус
	|ПОМЕСТИТЬ втСтатусЗаказа
	|ИЗ
	|	РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
	|			,
	|			Заказ В
	|					(ВЫБРАТЬ
	|						втЗаказы.Ссылка КАК Ссылка
	|					ИЗ
	|						втЗаказы КАК втЗаказы)
	|				И Статус = ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Доставлен)) КАК уатСтатусыГрузов_уэСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	уатСтатусыГрузов_уэСрезПоследних.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА НЕ втЗакрытие.ЗаказГрузоотправителя ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатСостоянияВыполненияЗаказов.Отклонен)
	|		ИНАЧЕ втРезультат.Состояние
	|	КОНЕЦ КАК Состояние,
	|	втРезультат.КоличествоВыполнено КАК КоличествоВыполнено,
	|	втРезультат.КоличествоВсего КАК КоличествоВсего,
	|	ВЫБОР
	|		КОГДА втРезультат.КоличествоВсего = 0
	|			ТОГДА 0
	|		ИНАЧЕ втРезультат.КоличествоВыполнено / втРезультат.КоличествоВсего * 100
	|	КОНЕЦ КАК ПроцентВыполнения,
	|	втРезультат.Заказ.FTL КАК ЗаказFTL,
	|	втРезультат.Заказ.ДетализацияЗакрытия КАК ЗаказДетализацияЗакрытия,
	|	втСтатусЗаказа.Статус КАК Статус
	|ИЗ
	|	втРезультат КАК втРезультат
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗакрытие КАК втЗакрытие
	|		ПО втРезультат.Заказ = втЗакрытие.ЗаказГрузоотправителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусЗаказа КАК втСтатусЗаказа
	|		ПО втРезультат.Заказ = втСтатусЗаказа.Заказ";
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.уатТекущееСостояниеВыполненияЗаказов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Заказ.Установить(Выборка.Заказ); 
			НаборЗаписей.Прочитать(); 
			
			Если НаборЗаписей.Количество() > 0 Тогда 
				Запись = НаборЗаписей[0];
			Иначе
				Запись = НаборЗаписей.Добавить();
			КонецЕсли;
			
			Если Выборка.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Отклонен
				И ОтклоненныеЗаказы.Найти(Выборка.Заказ) <> Неопределено Тогда
				Запись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Отклонен;
			Иначе
				Если ДополнительныеСвойства.Свойство("ТаблицаСтатусовГрузов") 
					И Выборка.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Выполнен 
					И Выборка.ЗаказFTL 
					И Выборка.ЗаказДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам Тогда
					ТаблицаСтатусовГрузов = ДополнительныеСвойства.ТаблицаСтатусовГрузов;  
					
					ТекСтатус = ТаблицаСтатусовГрузов.НайтиСтроки(Новый Структура("Заказ", Выборка.Заказ)); 
					Если ТекСтатус.Количество() <> 0 Тогда
						Если ТекСтатус[0].Статус <> Справочники.уатСтатусы_уэ.Доставлен Тогда
							ЗаполнитьЗначенияСвойств(Запись, Выборка);
							Запись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен;
						Иначе
							ЗаполнитьЗначенияСвойств(Запись, Выборка);
						КонецЕсли;
					КонецЕсли; 
				ИначеЕсли Выборка.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.Выполнен
					И Выборка.Статус <> Справочники.уатСтатусы_уэ.Доставлен
					И Выборка.ЗаказFTL 
					И Выборка.ЗаказДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоЗаказам Тогда
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.Состояние = Перечисления.уатСостоянияВыполненияЗаказов.ЧастичноВыполнен;

				Иначе
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
				КонецЕсли;
			КонецЕсли;
			
			НаборЗаписей.Записать();
		КонецЦикла; 
	Исключение
		Информация = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьСтатусыГрузов(ДокументСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМаршрутныйЛистЗаказы.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(уатМаршрутныйЛист.Дата, уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Дата, ДЕНЬ) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(уатМаршрутныйЛист.Дата, уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Дата, СЕКУНДА) >= 0
	|						ТОГДА ДОБАВИТЬКДАТЕ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Дата, СЕКУНДА, 1)
	|					ИНАЧЕ уатМаршрутныйЛист.Дата
	|				КОНЕЦ
	|		КОГДА РАЗНОСТЬДАТ(уатМаршрутныйЛист.Дата, уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Дата, ДЕНЬ) > 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.Дата, СЕКУНДА, 1)
	|		ИНАЧЕ уатМаршрутныйЛист.Дата
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.ПрибытиеФакт <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.ПрибытиеФакт
	|		КОГДА &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.УбытиеФакт <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.УбытиеФакт
	|		КОГДА НЕ &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.ПрибытиеПлан <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.ПрибытиеПлан
	|		ИНАЧЕ уатМаршрутныйЛист.Дата
	|	КОНЕЦ КАК ПрибытиеФакт,
	|	ВЫБОР
	|		КОГДА &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.УбытиеФакт <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.УбытиеФакт
	|		КОГДА &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.ПрибытиеФакт <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.ПрибытиеФакт
	|		КОГДА НЕ &флПланФакт
	|				И уатМаршрутныйЛистЗаказы.ПрибытиеПлан <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА уатМаршрутныйЛистЗаказы.ПрибытиеПлан
	|		ИНАЧЕ уатМаршрутныйЛист.Дата
	|	КОНЕЦ КАК УбытиеФакт,
	|	уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	ВЫБОР
	|		КОГДА уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.ДетализацияЗакрытия = ЗНАЧЕНИЕ(Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам)
	|			ТОГДА ВЫРАЗИТЬ(уатМаршрутныйЛистЗаказы.Номенклатура КАК Справочник.уатГрузовыеМеста_уэ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка)
	|	КОНЕЦ КАК ГрузовоеМесто,
	|	уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута КАК ТипТочки,
	|	уатМаршрутныйЛистЗаказы.Выполнен КАК СтатусВыполнения,
	|	уатМаршрутныйЛистЗаказы.ПричинаЗакрытияЗаказа КАК ПричинаЗакрытияЗаказа,
	|	уатМаршрутныйЛистЗаказы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВРТ_Документ
	|ИЗ
	|	Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|		ПО уатМаршрутныйЛистЗаказы.Ссылка = уатМаршрутныйЛист.Ссылка
	|ГДЕ
	|	уатМаршрутныйЛистЗаказы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_Документ.Регистратор КАК Регистратор,
	|	МАКСИМУМ(ВРТ_Документ.ПрибытиеФакт) КАК Период,
	|	ВРТ_Документ.ЗаказГрузоотправителя КАК Заказ,
	|	ВРТ_Документ.ГрузовоеМесто КАК ГрузовоеМесто,
	|	2 КАК Порядок
	|ПОМЕСТИТЬ ВРТ_ВыборСтатусов
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|ГДЕ
	|	ВРТ_Документ.ТипТочки В(&ТипыТочекРазгрузка)
	|	И ВРТ_Документ.СтатусВыполнения
	|	И НЕ ВРТ_Документ.ЗаказГрузоотправителя.FTL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_Документ.Регистратор,
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВРТ_Документ.Регистратор,
	|	МАКСИМУМ(ВРТ_Документ.УбытиеФакт),
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто,
	|	1
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|ГДЕ
	|	ВРТ_Документ.ТипТочки В(&ТипыТочекПогрузка)
	|	И ВРТ_Документ.СтатусВыполнения
	|	И НЕ ВРТ_Документ.ЗаказГрузоотправителя.FTL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_Документ.Регистратор,
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВРТ_Документ.Регистратор,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ДатаДокумента, ВРТ_Документ.ПрибытиеФакт, СЕКУНДА) < 0
	|				ТОГДА ВЫБОР
	|						КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ПрибытиеФакт, ВРТ_Документ.УбытиеФакт, СЕКУНДА) < 0
	|							ТОГДА ВРТ_Документ.УбытиеФакт
	|						ИНАЧЕ ВРТ_Документ.ПрибытиеФакт
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ДатаДокумента, ВРТ_Документ.УбытиеФакт, СЕКУНДА) < 0
	|						ТОГДА ВРТ_Документ.УбытиеФакт
	|					ИНАЧЕ ВРТ_Документ.ДатаДокумента
	|				КОНЕЦ
	|		КОНЕЦ),
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто,
	|	0
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|ГДЕ
	|	ВРТ_Документ.ТипТочки <> ЗНАЧЕНИЕ(Перечисление.уатТипыТочекМаршрута.ПромежуточныйПункт)
	|	И НЕ ВРТ_Документ.ЗаказГрузоотправителя.FTL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_Документ.Регистратор,
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВРТ_Документ.Регистратор,
	|	МАКСИМУМ(ВРТ_Документ.ПрибытиеФакт),
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто,
	|	3
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|ГДЕ
	|	ВРТ_Документ.ПричинаЗакрытияЗаказа = ЗНАЧЕНИЕ(Справочник.уатПричиныЗакрытияЗаказов.Отклонен)
	|	И НЕ ВРТ_Документ.ЗаказГрузоотправителя.FTL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_Документ.Регистратор,
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_ВыборСтатусов.Регистратор КАК Регистратор,
	|	ВРТ_ВыборСтатусов.Период КАК Период,
	|	ВРТ_ВыборСтатусов.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВРТ_ВыборСтатусов.ГрузовоеМесто, ЗНАЧЕНИЕ(Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка)) КАК ГрузовоеМесто,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВРТ_ВыборСтатусов.Порядок) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Доставлен)
	|		КОГДА МАКСИМУМ(ВРТ_ВыборСтатусов.Порядок) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Отправлен)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Размещен)
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	ВРТ_ВыборСтатусов КАК ВРТ_ВыборСтатусов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_ВыборСтатусов.Регистратор,
	|	ВРТ_ВыборСтатусов.Период,
	|	ВРТ_ВыборСтатусов.Заказ,
	|	ВРТ_ВыборСтатусов.ГрузовоеМесто
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(ВРТ_ВыборСтатусов.Порядок) = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_Документ.Регистратор КАК Регистратор,
	|	ВРТ_Документ.ДатаДокумента КАК ДатаДокумента,
	|	ВРТ_Документ.ПрибытиеФакт КАК ПрибытиеФакт,
	|	ВРТ_Документ.УбытиеФакт КАК УбытиеФакт,
	|	ВРТ_Документ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	ВРТ_Документ.ГрузовоеМесто КАК ГрузовоеМесто,
	|	ВРТ_Документ.ТипТочки КАК ТипТочки,
	|	ВРТ_Документ.СтатусВыполнения КАК СтатусВыполнения,
	|	ВРТ_Документ.ПричинаЗакрытияЗаказа КАК ПричинаЗакрытияЗаказа,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ДатаДокумента, ВРТ_Документ.ПрибытиеФакт, СЕКУНДА) < 0
	|			ТОГДА ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ПрибытиеФакт, ВРТ_Документ.УбытиеФакт, СЕКУНДА) < 0
	|						ТОГДА ВРТ_Документ.УбытиеФакт
	|					ИНАЧЕ ВРТ_Документ.ПрибытиеФакт
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(ВРТ_Документ.ДатаДокумента, ВРТ_Документ.УбытиеФакт, СЕКУНДА) < 0
	|					ТОГДА ВРТ_Документ.УбытиеФакт
	|				ИНАЧЕ ВРТ_Документ.ДатаДокумента
	|			КОНЕЦ
	|	КОНЕЦ КАК Дата,
	|	ВРТ_Документ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|ГДЕ
	|	ВРТ_Документ.ЗаказГрузоотправителя.FTL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	ЗаказГрузоотправителя,
	|	ГрузовоеМесто,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ЗаказГрузоотправителя,
	|	ГрузовоеМесто");
	
	ТипыТочекПогрузка = Новый Массив();
	ТипыТочекПогрузка.Добавить(Перечисления.уатТипыТочекМаршрута.Погрузка); 
	ТипыТочекПогрузка.Добавить(Перечисления.уатТипыТочекМаршрута.ДополнительнаяПогрузка);
	
	ТипыТочекРазгрузка = Новый Массив();
	ТипыТочекРазгрузка.Добавить(Перечисления.уатТипыТочекМаршрута.Разгрузка); 
	ТипыТочекРазгрузка.Добавить(Перечисления.уатТипыТочекМаршрута.ДополнительнаяРазгрузка);

	Запрос.УстановитьПараметр("ТипыТочекПогрузка", ТипыТочекПогрузка);
	Запрос.УстановитьПараметр("ТипыТочекРазгрузка", ТипыТочекРазгрузка);

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("флПланФакт", Константы.уатУчетПланФактаПоМаршрутуВМаршрутныхЛистах.Получить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаСтатусовГрузов = РезультатЗапроса[2].Выгрузить();
	
	ВыборкаСтатусовFTLГрузов = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатусовFTLГрузов.Следующий() Цикл
		ВыборкаСтатусовFTLЗаказа = ВыборкаСтатусовFTLГрузов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатусовFTLЗаказа.Следующий() Цикл
			ВыборкаСтатусовFTLЗаказаГруз = ВыборкаСтатусовFTLЗаказа.Выбрать();
			
			КолВоПогрузокЗаказ  = 0;
			КолВоРазгрузокЗаказ = 0; 
			КолВоПогрузок  = 0;
			КолВоРазгрузок = 0;
			
			ПрибытиеФакт   = Неопределено;
			УбытиеФакт     = Неопределено; 
			Дата           = Неопределено;
			Пока ВыборкаСтатусовFTLЗаказаГруз.Следующий() Цикл
				Если ТипыТочекПогрузка.Найти(ВыборкаСтатусовFTLЗаказаГруз.ТипТочки) <> Неопределено Тогда
					КолВоПогрузокЗаказ = КолВоПогрузокЗаказ + 1;  
					Если ВыборкаСтатусовFTLЗаказаГруз.СтатусВыполнения = Истина
						ИЛИ ВыборкаСтатусовFTLЗаказаГруз.ПричинаЗакрытияЗаказа = Справочники.уатПричиныЗакрытияЗаказов.Отклонен Тогда
						КолВоПогрузок = КолВоПогрузок + 1;
						Если УбытиеФакт = Неопределено
							И ВыборкаСтатусовFTLЗаказаГруз.СтатусВыполнения = Истина Тогда 
							УбытиеФакт = ВыборкаСтатусовFTLЗаказаГруз.УбытиеФакт;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ТипыТочекРазгрузка.Найти(ВыборкаСтатусовFTLЗаказаГруз.ТипТочки) <> Неопределено Тогда
					КолВоРазгрузокЗаказ = КолВоРазгрузокЗаказ + 1;
					
					Если ВыборкаСтатусовFTLЗаказаГруз.СтатусВыполнения = Истина
						ИЛИ ВыборкаСтатусовFTLЗаказаГруз.ПричинаЗакрытияЗаказа = Справочники.уатПричиныЗакрытияЗаказов.Отклонен Тогда
						КолВоРазгрузок = КолВоРазгрузок + 1;
						
						Если ВыборкаСтатусовFTLЗаказаГруз.СтатусВыполнения = Истина Тогда
							ПрибытиеФакт   = ВыборкаСтатусовFTLЗаказаГруз.ПрибытиеФакт; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Дата = ВыборкаСтатусовFTLЗаказаГруз.Дата; 
			КонецЦикла; 

			Статус = Справочники.уатСтатусы_уэ.Размещен; 
			Период = Дата;
			Если КолВоПогрузокЗаказ = КолВоПогрузок
				И КолВоРазгрузокЗаказ = КолВоРазгрузок Тогда
				Статус = Справочники.уатСтатусы_уэ.Доставлен;
				Период = ПрибытиеФакт;
			ИначеЕсли КолВоПогрузок <> 0 Тогда
				Статус = Справочники.уатСтатусы_уэ.Отправлен; 
				Период = УбытиеФакт;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(Период) Тогда
				Период = Дата;
			КонецЕсли; 
			
			НоваяСтрока = ТаблицаСтатусовГрузов.Добавить(); 
			НоваяСтрока.Регистратор   = ДокументСсылка;
			НоваяСтрока.Период	      = Период;
			НоваяСтрока.Заказ         = ВыборкаСтатусовFTLГрузов.ЗаказГрузоотправителя;
			НоваяСтрока.ГрузовоеМесто = ВыборкаСтатусовFTLЗаказа.ГрузовоеМесто; 
			НоваяСтрока.Статус        = Статус;
		КонецЦикла;
	КонецЦикла;
	Возврат ТаблицаСтатусовГрузов;
	
КонецФункции  

#КонецОбласти

#КонецЕсли
